# GroupPropagationFailedSketch Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..GroupFailures..::..GroupPropagationFailedSketch Property
BuiltInFailures..::..GroupFailures Class See Also
---
Can't change Group"[Name]" with more than one instance because it has a Sketch-based element. Edit the Sketch of the element instead.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId GroupPropagationFailedSketch { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GroupPropagationFailedSketch As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ GroupPropagationFailedSketch {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..GroupFailures Class
Autodesk.Revit.DB Namespace